MikroElektronika/core_packages/PIC/XC8/def/PIC16F18345/mcu.h
extern volatile PWM6DCHbits_t PWM6DCHbits __at(0x61B);
// bitfield macros
#define _PWM6DCH_PWM6DCH_POSN                               0x0
#define _PWM6DCH_PWM6DCH_POSITION                           0x0
#define _PWM6DCH_PWM6DCH_SIZE                               0x8
#define _PWM6DCH_PWM6DCH_LENGTH                             0x8
#define _PWM6DCH_PWM6DCH_MASK                               0xFF
#define _PWM6DCH_PWM6DCH0_POSN                              0x0
#define _PWM6DCH_PWM6DCH0_POSITION                          0x0
#define _PWM6DCH_PWM6DCH0_SIZE                              0x1
#define _PWM6DCH_PWM6DCH0_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH0_MASK                              0x1
#define _PWM6DCH_PWM6DCH1_POSN                              0x1
#define _PWM6DCH_PWM6DCH1_POSITION                          0x1
#define _PWM6DCH_PWM6DCH1_SIZE                              0x1
#define _PWM6DCH_PWM6DCH1_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH1_MASK                              0x2
#define _PWM6DCH_PWM6DCH2_POSN                              0x2
#define _PWM6DCH_PWM6DCH2_POSITION                          0x2
#define _PWM6DCH_PWM6DCH2_SIZE                              0x1
#define _PWM6DCH_PWM6DCH2_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH2_MASK                              0x4
#define _PWM6DCH_PWM6DCH3_POSN                              0x3
#define _PWM6DCH_PWM6DCH3_POSITION                          0x3
#define _PWM6DCH_PWM6DCH3_SIZE                              0x1
#define _PWM6DCH_PWM6DCH3_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH3_MASK                              0x8
#define _PWM6DCH_PWM6DCH4_POSN                              0x4
#define _PWM6DCH_PWM6DCH4_POSITION                          0x4
#define _PWM6DCH_PWM6DCH4_SIZE                              0x1
#define _PWM6DCH_PWM6DCH4_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH4_MASK                              0x10
#define _PWM6DCH_PWM6DCH5_POSN                              0x5
#define _PWM6DCH_PWM6DCH5_POSITION                          0x5
#define _PWM6DCH_PWM6DCH5_SIZE                              0x1
#define _PWM6DCH_PWM6DCH5_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH5_MASK                              0x20
#define _PWM6DCH_PWM6DCH6_POSN                              0x6
#define _PWM6DCH_PWM6DCH6_POSITION                          0x6
#define _PWM6DCH_PWM6DCH6_SIZE                              0x1
#define _PWM6DCH_PWM6DCH6_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH6_MASK                              0x40
#define _PWM6DCH_PWM6DCH7_POSN                              0x7
#define _PWM6DCH_PWM6DCH7_POSITION                          0x7
#define _PWM6DCH_PWM6DCH7_SIZE                              0x1
#define _PWM6DCH_PWM6DCH7_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH7_MASK                              0x80

// Register: PWM6CON
#define PWM6CON PWM6CON
extern volatile unsigned char           PWM6CON             __at(0x61C);
#ifndef _LIB_BUILD
asm("PWM6CON equ 061Ch");
#endif
// aliases
extern volatile unsigned char           PWM6CON0            __at(0x61C);
#ifndef _LIB_BUILD
asm("PWM6CON0 equ 061Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned PWM6POL                :1;
        unsigned PWM6OUT                :1;
        unsigned                        :1;
        unsigned PWM6EN                 :1;
    };
} PWM6CONbits_t;
extern volatile PWM6CONbits_t PWM6CONbits __at(0x61C);
// bitfield macros
#define _PWM6CON_PWM6POL_POSN                               0x4
#define _PWM6CON_PWM6POL_POSITION                           0x4
#define _PWM6CON_PWM6POL_SIZE                               0x1
#define _PWM6CON_PWM6POL_LENGTH                             0x1
#define _PWM6CON_PWM6POL_MASK                               0x10
#define _PWM6CON_PWM6OUT_POSN                               0x5
#define _PWM6CON_PWM6OUT_POSITION                           0x5
#define _PWM6CON_PWM6OUT_SIZE                               0x1
#define _PWM6CON_PWM6OUT_LENGTH                             0x1
#define _PWM6CON_PWM6OUT_MASK                               0x20
#define _PWM6CON_PWM6EN_POSN                                0x7
#define _PWM6CON_PWM6EN_POSITION                            0x7
#define _PWM6CON_PWM6EN_SIZE                                0x1
#define _PWM6CON_PWM6EN_LENGTH                              0x1
#define _PWM6CON_PWM6EN_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned PWM6POL                :1;
        unsigned PWM6OUT                :1;
        unsigned                        :1;
        unsigned PWM6EN                 :1;
    };
} PWM6CON0bits_t;
extern volatile PWM6CON0bits_t PWM6CON0bits __at(0x61C);
// bitfield macros
#define _PWM6CON0_PWM6POL_POSN                              0x4
#define _PWM6CON0_PWM6POL_POSITION                          0x4
#define _PWM6CON0_PWM6POL_SIZE                              0x1
#define _PWM6CON0_PWM6POL_LENGTH                            0x1
#define _PWM6CON0_PWM6POL_MASK                              0x10
#define _PWM6CON0_PWM6OUT_POSN                              0x5
#define _PWM6CON0_PWM6OUT_POSITION                          0x5
#define _PWM6CON0_PWM6OUT_SIZE                              0x1
#define _PWM6CON0_PWM6OUT_LENGTH                            0x1
#define _PWM6CON0_PWM6OUT_MASK                              0x20
#define _PWM6CON0_PWM6EN_POSN                               0x7
#define _PWM6CON0_PWM6EN_POSITION                           0x7
#define _PWM6CON0_PWM6EN_SIZE                               0x1
#define _PWM6CON0_PWM6EN_LENGTH                             0x1
#define _PWM6CON0_PWM6EN_MASK                               0x80

// Register: PWMTMRS
#define PWMTMRS PWMTMRS
extern volatile unsigned char           PWMTMRS             __at(0x61F);
#ifndef _LIB_BUILD
asm("PWMTMRS equ 061Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P5TSEL                 :2;
        unsigned P6TSEL                 :2;
    };
    struct {
        unsigned P5TSEL0                :1;
        unsigned P5TSEL1                :1;
        unsigned P6TSEL0                :1;
        unsigned P6TSEL1                :1;
    };
} PWMTMRSbits_t;
extern volatile PWMTMRSbits_t PWMTMRSbits __at(0x61F);
// bitfield macros
#define _PWMTMRS_P5TSEL_POSN                                0x0
#define _PWMTMRS_P5TSEL_POSITION                            0x0
#define _PWMTMRS_P5TSEL_SIZE                                0x2
#define _PWMTMRS_P5TSEL_LENGTH                              0x2
#define _PWMTMRS_P5TSEL_MASK                                0x3
#define _PWMTMRS_P6TSEL_POSN                                0x2
#define _PWMTMRS_P6TSEL_POSITION                            0x2
#define _PWMTMRS_P6TSEL_SIZE                                0x2
#define _PWMTMRS_P6TSEL_LENGTH                              0x2
#define _PWMTMRS_P6TSEL_MASK                                0xC
#define _PWMTMRS_P5TSEL0_POSN                               0x0
#define _PWMTMRS_P5TSEL0_POSITION                           0x0
#define _PWMTMRS_P5TSEL0_SIZE                               0x1
#define _PWMTMRS_P5TSEL0_LENGTH                             0x1
#define _PWMTMRS_P5TSEL0_MASK                               0x1
#define _PWMTMRS_P5TSEL1_POSN                               0x1
#define _PWMTMRS_P5TSEL1_POSITION                           0x1
#define _PWMTMRS_P5TSEL1_SIZE                               0x1
#define _PWMTMRS_P5TSEL1_LENGTH                             0x1
#define _PWMTMRS_P5TSEL1_MASK                               0x2
#define _PWMTMRS_P6TSEL0_POSN                               0x2
#define _PWMTMRS_P6TSEL0_POSITION                           0x2
#define _PWMTMRS_P6TSEL0_SIZE                               0x1
#define _PWMTMRS_P6TSEL0_LENGTH                             0x1
#define _PWMTMRS_P6TSEL0_MASK                               0x4
#define _PWMTMRS_P6TSEL1_POSN                               0x3
#define _PWMTMRS_P6TSEL1_POSITION                           0x3
#define _PWMTMRS_P6TSEL1_SIZE                               0x1
#define _PWMTMRS_P6TSEL1_LENGTH                             0x1
#define _PWMTMRS_P6TSEL1_MASK                               0x8

