MikroElektronika/core_packages/PIC/XC8/def/PIC16F18345/mcu.h
// Register: CWG2AS1
#define CWG2AS1 CWG2AS1
extern volatile unsigned char           CWG2AS1             __at(0x718);
#ifndef _LIB_BUILD
asm("CWG2AS1 equ 0718h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
    };
} CWG2AS1bits_t;
extern volatile CWG2AS1bits_t CWG2AS1bits __at(0x718);
// bitfield macros
#define _CWG2AS1_AS0E_POSN                                  0x0
#define _CWG2AS1_AS0E_POSITION                              0x0
#define _CWG2AS1_AS0E_SIZE                                  0x1
#define _CWG2AS1_AS0E_LENGTH                                0x1
#define _CWG2AS1_AS0E_MASK                                  0x1
#define _CWG2AS1_AS1E_POSN                                  0x1
#define _CWG2AS1_AS1E_POSITION                              0x1
#define _CWG2AS1_AS1E_SIZE                                  0x1
#define _CWG2AS1_AS1E_LENGTH                                0x1
#define _CWG2AS1_AS1E_MASK                                  0x2
#define _CWG2AS1_AS2E_POSN                                  0x2
#define _CWG2AS1_AS2E_POSITION                              0x2
#define _CWG2AS1_AS2E_SIZE                                  0x1
#define _CWG2AS1_AS2E_LENGTH                                0x1
#define _CWG2AS1_AS2E_MASK                                  0x4
#define _CWG2AS1_AS3E_POSN                                  0x3
#define _CWG2AS1_AS3E_POSITION                              0x3
#define _CWG2AS1_AS3E_SIZE                                  0x1
#define _CWG2AS1_AS3E_LENGTH                                0x1
#define _CWG2AS1_AS3E_MASK                                  0x8
#define _CWG2AS1_AS4E_POSN                                  0x4
#define _CWG2AS1_AS4E_POSITION                              0x4
#define _CWG2AS1_AS4E_SIZE                                  0x1
#define _CWG2AS1_AS4E_LENGTH                                0x1
#define _CWG2AS1_AS4E_MASK                                  0x10

// Register: CWG2STR
#define CWG2STR CWG2STR
extern volatile unsigned char           CWG2STR             __at(0x719);
#ifndef _LIB_BUILD
asm("CWG2STR equ 0719h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned OVRA                   :1;
        unsigned OVRB                   :1;
        unsigned OVRC                   :1;
        unsigned OVRD                   :1;
    };
    struct {
        unsigned CWG2STRA               :1;
        unsigned CWG2STRB               :1;
        unsigned CWG2STRC               :1;
        unsigned CWG2STRD               :1;
        unsigned CWG2OVRA               :1;
        unsigned CWG2OVRB               :1;
        unsigned CWG2OVRC               :1;
        unsigned CWG2OVRD               :1;
    };
} CWG2STRbits_t;
extern volatile CWG2STRbits_t CWG2STRbits __at(0x719);
// bitfield macros
#define _CWG2STR_STRA_POSN                                  0x0
#define _CWG2STR_STRA_POSITION                              0x0
#define _CWG2STR_STRA_SIZE                                  0x1
#define _CWG2STR_STRA_LENGTH                                0x1
#define _CWG2STR_STRA_MASK                                  0x1
#define _CWG2STR_STRB_POSN                                  0x1
#define _CWG2STR_STRB_POSITION                              0x1
#define _CWG2STR_STRB_SIZE                                  0x1
#define _CWG2STR_STRB_LENGTH                                0x1
#define _CWG2STR_STRB_MASK                                  0x2
#define _CWG2STR_STRC_POSN                                  0x2
#define _CWG2STR_STRC_POSITION                              0x2
#define _CWG2STR_STRC_SIZE                                  0x1
#define _CWG2STR_STRC_LENGTH                                0x1
#define _CWG2STR_STRC_MASK                                  0x4
#define _CWG2STR_STRD_POSN                                  0x3
#define _CWG2STR_STRD_POSITION                              0x3
#define _CWG2STR_STRD_SIZE                                  0x1
#define _CWG2STR_STRD_LENGTH                                0x1
#define _CWG2STR_STRD_MASK                                  0x8
#define _CWG2STR_OVRA_POSN                                  0x4
#define _CWG2STR_OVRA_POSITION                              0x4
#define _CWG2STR_OVRA_SIZE                                  0x1
#define _CWG2STR_OVRA_LENGTH                                0x1
#define _CWG2STR_OVRA_MASK                                  0x10
#define _CWG2STR_OVRB_POSN                                  0x5
#define _CWG2STR_OVRB_POSITION                              0x5
#define _CWG2STR_OVRB_SIZE                                  0x1
#define _CWG2STR_OVRB_LENGTH                                0x1
#define _CWG2STR_OVRB_MASK                                  0x20
#define _CWG2STR_OVRC_POSN                                  0x6
#define _CWG2STR_OVRC_POSITION                              0x6
#define _CWG2STR_OVRC_SIZE                                  0x1
#define _CWG2STR_OVRC_LENGTH                                0x1
#define _CWG2STR_OVRC_MASK                                  0x40
#define _CWG2STR_OVRD_POSN                                  0x7
#define _CWG2STR_OVRD_POSITION                              0x7
#define _CWG2STR_OVRD_SIZE                                  0x1
#define _CWG2STR_OVRD_LENGTH                                0x1
#define _CWG2STR_OVRD_MASK                                  0x80
#define _CWG2STR_CWG2STRA_POSN                              0x0
#define _CWG2STR_CWG2STRA_POSITION                          0x0
#define _CWG2STR_CWG2STRA_SIZE                              0x1
#define _CWG2STR_CWG2STRA_LENGTH                            0x1
#define _CWG2STR_CWG2STRA_MASK                              0x1
#define _CWG2STR_CWG2STRB_POSN                              0x1
#define _CWG2STR_CWG2STRB_POSITION                          0x1
#define _CWG2STR_CWG2STRB_SIZE                              0x1
#define _CWG2STR_CWG2STRB_LENGTH                            0x1
#define _CWG2STR_CWG2STRB_MASK                              0x2
#define _CWG2STR_CWG2STRC_POSN                              0x2
#define _CWG2STR_CWG2STRC_POSITION                          0x2
#define _CWG2STR_CWG2STRC_SIZE                              0x1
#define _CWG2STR_CWG2STRC_LENGTH                            0x1
#define _CWG2STR_CWG2STRC_MASK                              0x4
#define _CWG2STR_CWG2STRD_POSN                              0x3
#define _CWG2STR_CWG2STRD_POSITION                          0x3
#define _CWG2STR_CWG2STRD_SIZE                              0x1
#define _CWG2STR_CWG2STRD_LENGTH                            0x1
#define _CWG2STR_CWG2STRD_MASK                              0x8
#define _CWG2STR_CWG2OVRA_POSN                              0x4
#define _CWG2STR_CWG2OVRA_POSITION                          0x4
#define _CWG2STR_CWG2OVRA_SIZE                              0x1
#define _CWG2STR_CWG2OVRA_LENGTH                            0x1
#define _CWG2STR_CWG2OVRA_MASK                              0x10
#define _CWG2STR_CWG2OVRB_POSN                              0x5
#define _CWG2STR_CWG2OVRB_POSITION                          0x5
#define _CWG2STR_CWG2OVRB_SIZE                              0x1
#define _CWG2STR_CWG2OVRB_LENGTH                            0x1
#define _CWG2STR_CWG2OVRB_MASK                              0x20
#define _CWG2STR_CWG2OVRC_POSN                              0x6
#define _CWG2STR_CWG2OVRC_POSITION                          0x6
#define _CWG2STR_CWG2OVRC_SIZE                              0x1
#define _CWG2STR_CWG2OVRC_LENGTH                            0x1
#define _CWG2STR_CWG2OVRC_MASK                              0x40
#define _CWG2STR_CWG2OVRD_POSN                              0x7
#define _CWG2STR_CWG2OVRD_POSITION                          0x7
#define _CWG2STR_CWG2OVRD_SIZE                              0x1
#define _CWG2STR_CWG2OVRD_LENGTH                            0x1
#define _CWG2STR_CWG2OVRD_MASK                              0x80

// Register: NVMADR
#define NVMADR NVMADR
extern volatile unsigned short          NVMADR              __at(0x891);
#ifndef _LIB_BUILD
asm("NVMADR equ 0891h");
#endif
// aliases
extern volatile unsigned short          EEADR               __at(0x891);
#ifndef _LIB_BUILD
asm("EEADR equ 0891h");
#endif
extern volatile unsigned short          PMADR               __at(0x891);
#ifndef _LIB_BUILD
asm("PMADR equ 0891h");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x891);
#ifndef _LIB_BUILD
asm("NVMADRL equ 0891h");
#endif
// aliases
extern volatile unsigned char           EEADRL              __at(0x891);
#ifndef _LIB_BUILD
asm("EEADRL equ 0891h");
#endif
extern volatile unsigned char           PMADRL              __at(0x891);
#ifndef _LIB_BUILD
asm("PMADRL equ 0891h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRL                :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
    struct {
        unsigned EEADRL                 :8;
    };
    struct {
        unsigned PMADRL                 :8;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x891);
// bitfield macros
#define _NVMADRL_NVMADRL_POSN                               0x0
#define _NVMADRL_NVMADRL_POSITION                           0x0
#define _NVMADRL_NVMADRL_SIZE                               0x8
#define _NVMADRL_NVMADRL_LENGTH                             0x8
#define _NVMADRL_NVMADRL_MASK                               0xFF
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80
#define _NVMADRL_EEADRL_POSN                                0x0
#define _NVMADRL_EEADRL_POSITION                            0x0
#define _NVMADRL_EEADRL_SIZE                                0x8
#define _NVMADRL_EEADRL_LENGTH                              0x8
#define _NVMADRL_EEADRL_MASK                                0xFF
#define _NVMADRL_PMADRL_POSN                                0x0
#define _NVMADRL_PMADRL_POSITION                            0x0
#define _NVMADRL_PMADRL_SIZE                                0x8
#define _NVMADRL_PMADRL_LENGTH                              0x8
#define _NVMADRL_PMADRL_MASK                                0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned NVMADRL                :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
    struct {
        unsigned EEADRL                 :8;
    };
    struct {
        unsigned PMADRL                 :8;
    };
} EEADRLbits_t;
extern volatile EEADRLbits_t EEADRLbits __at(0x891);
// bitfield macros
#define _EEADRL_NVMADRL_POSN                                0x0
#define _EEADRL_NVMADRL_POSITION                            0x0
#define _EEADRL_NVMADRL_SIZE                                0x8
#define _EEADRL_NVMADRL_LENGTH                              0x8
#define _EEADRL_NVMADRL_MASK                                0xFF
#define _EEADRL_NVMADR0_POSN                                0x0
#define _EEADRL_NVMADR0_POSITION                            0x0
#define _EEADRL_NVMADR0_SIZE                                0x1
#define _EEADRL_NVMADR0_LENGTH                              0x1
#define _EEADRL_NVMADR0_MASK                                0x1
#define _EEADRL_NVMADR1_POSN                                0x1
#define _EEADRL_NVMADR1_POSITION                            0x1
#define _EEADRL_NVMADR1_SIZE                                0x1
#define _EEADRL_NVMADR1_LENGTH                              0x1
#define _EEADRL_NVMADR1_MASK                                0x2
#define _EEADRL_NVMADR2_POSN                                0x2
#define _EEADRL_NVMADR2_POSITION                            0x2
#define _EEADRL_NVMADR2_SIZE                                0x1
#define _EEADRL_NVMADR2_LENGTH                              0x1
#define _EEADRL_NVMADR2_MASK                                0x4
#define _EEADRL_NVMADR3_POSN                                0x3
#define _EEADRL_NVMADR3_POSITION                            0x3
#define _EEADRL_NVMADR3_SIZE                                0x1
#define _EEADRL_NVMADR3_LENGTH                              0x1
#define _EEADRL_NVMADR3_MASK                                0x8
#define _EEADRL_NVMADR4_POSN                                0x4
#define _EEADRL_NVMADR4_POSITION                            0x4
#define _EEADRL_NVMADR4_SIZE                                0x1
#define _EEADRL_NVMADR4_LENGTH                              0x1
#define _EEADRL_NVMADR4_MASK                                0x10
#define _EEADRL_NVMADR5_POSN                                0x5
#define _EEADRL_NVMADR5_POSITION                            0x5
#define _EEADRL_NVMADR5_SIZE                                0x1
#define _EEADRL_NVMADR5_LENGTH                              0x1
#define _EEADRL_NVMADR5_MASK                                0x20
#define _EEADRL_NVMADR6_POSN                                0x6
#define _EEADRL_NVMADR6_POSITION                            0x6
#define _EEADRL_NVMADR6_SIZE                                0x1
#define _EEADRL_NVMADR6_LENGTH                              0x1
#define _EEADRL_NVMADR6_MASK                                0x40
#define _EEADRL_NVMADR7_POSN                                0x7
#define _EEADRL_NVMADR7_POSITION                            0x7
#define _EEADRL_NVMADR7_SIZE                                0x1
#define _EEADRL_NVMADR7_LENGTH                              0x1
#define _EEADRL_NVMADR7_MASK                                0x80
#define _EEADRL_EEADRL_POSN                                 0x0
#define _EEADRL_EEADRL_POSITION                             0x0
#define _EEADRL_EEADRL_SIZE                                 0x8
#define _EEADRL_EEADRL_LENGTH                               0x8
#define _EEADRL_EEADRL_MASK                                 0xFF
#define _EEADRL_PMADRL_POSN                                 0x0
#define _EEADRL_PMADRL_POSITION                             0x0
#define _EEADRL_PMADRL_SIZE                                 0x8
#define _EEADRL_PMADRL_LENGTH                               0x8
#define _EEADRL_PMADRL_MASK                                 0xFF
typedef union {
    struct {
        unsigned NVMADRL                :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
    struct {
        unsigned EEADRL                 :8;
    };
    struct {
        unsigned PMADRL                 :8;
    };
} PMADRLbits_t;
extern volatile PMADRLbits_t PMADRLbits __at(0x891);
// bitfield macros
#define _PMADRL_NVMADRL_POSN                                0x0
#define _PMADRL_NVMADRL_POSITION                            0x0
#define _PMADRL_NVMADRL_SIZE                                0x8
#define _PMADRL_NVMADRL_LENGTH                              0x8
#define _PMADRL_NVMADRL_MASK                                0xFF
#define _PMADRL_NVMADR0_POSN                                0x0
#define _PMADRL_NVMADR0_POSITION                            0x0
#define _PMADRL_NVMADR0_SIZE                                0x1
#define _PMADRL_NVMADR0_LENGTH                              0x1
#define _PMADRL_NVMADR0_MASK                                0x1
#define _PMADRL_NVMADR1_POSN                                0x1
#define _PMADRL_NVMADR1_POSITION                            0x1
#define _PMADRL_NVMADR1_SIZE                                0x1
#define _PMADRL_NVMADR1_LENGTH                              0x1
#define _PMADRL_NVMADR1_MASK                                0x2
#define _PMADRL_NVMADR2_POSN                                0x2
#define _PMADRL_NVMADR2_POSITION                            0x2
#define _PMADRL_NVMADR2_SIZE                                0x1
#define _PMADRL_NVMADR2_LENGTH                              0x1
#define _PMADRL_NVMADR2_MASK                                0x4
#define _PMADRL_NVMADR3_POSN                                0x3
#define _PMADRL_NVMADR3_POSITION                            0x3
#define _PMADRL_NVMADR3_SIZE                                0x1
#define _PMADRL_NVMADR3_LENGTH                              0x1
#define _PMADRL_NVMADR3_MASK                                0x8
#define _PMADRL_NVMADR4_POSN                                0x4
#define _PMADRL_NVMADR4_POSITION                            0x4
#define _PMADRL_NVMADR4_SIZE                                0x1
#define _PMADRL_NVMADR4_LENGTH                              0x1
#define _PMADRL_NVMADR4_MASK                                0x10
#define _PMADRL_NVMADR5_POSN                                0x5
#define _PMADRL_NVMADR5_POSITION                            0x5
#define _PMADRL_NVMADR5_SIZE                                0x1
#define _PMADRL_NVMADR5_LENGTH                              0x1
#define _PMADRL_NVMADR5_MASK                                0x20
#define _PMADRL_NVMADR6_POSN                                0x6
#define _PMADRL_NVMADR6_POSITION                            0x6
#define _PMADRL_NVMADR6_SIZE                                0x1
#define _PMADRL_NVMADR6_LENGTH                              0x1
#define _PMADRL_NVMADR6_MASK                                0x40
#define _PMADRL_NVMADR7_POSN                                0x7
#define _PMADRL_NVMADR7_POSITION                            0x7
#define _PMADRL_NVMADR7_SIZE                                0x1
#define _PMADRL_NVMADR7_LENGTH                              0x1
#define _PMADRL_NVMADR7_MASK                                0x80
#define _PMADRL_EEADRL_POSN                                 0x0
#define _PMADRL_EEADRL_POSITION                             0x0
#define _PMADRL_EEADRL_SIZE                                 0x8
#define _PMADRL_EEADRL_LENGTH                               0x8
#define _PMADRL_EEADRL_MASK                                 0xFF
#define _PMADRL_PMADRL_POSN                                 0x0
#define _PMADRL_PMADRL_POSITION                             0x0
#define _PMADRL_PMADRL_SIZE                                 0x8
#define _PMADRL_PMADRL_LENGTH                               0x8
#define _PMADRL_PMADRL_MASK                                 0xFF

