MikroElektronika/core_packages/PIC/XC8/def/PIC16F18345/mcu.h
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x48DC);	// @ (0x91B * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE3<OSFIE>
extern volatile __bit                   OSFIE               __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE3,7)
// PIR3<OSFIF>
extern volatile __bit                   OSFIF               __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR3,7)
// PWMTMRS<P5TSEL0>
extern volatile __bit                   P5TSEL0             __at(0x30F8);	// @ (0x61F * 8 + 0)
#define                                 P5TSEL0_bit         _BIT_ACCESS(PWMTMRS,0)
// PWMTMRS<P5TSEL1>
extern volatile __bit                   P5TSEL1             __at(0x30F9);	// @ (0x61F * 8 + 1)
#define                                 P5TSEL1_bit         _BIT_ACCESS(PWMTMRS,1)
// PWMTMRS<P6TSEL0>
extern volatile __bit                   P6TSEL0             __at(0x30FA);	// @ (0x61F * 8 + 2)
#define                                 P6TSEL0_bit         _BIT_ACCESS(PWMTMRS,2)
// PWMTMRS<P6TSEL1>
extern volatile __bit                   P6TSEL1             __at(0x30FB);	// @ (0x61F * 8 + 3)
#define                                 P6TSEL1_bit         _BIT_ACCESS(PWMTMRS,3)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OSCSTAT1<PLLR>
extern volatile __bit                   PLLR                __at(0x48E0);	// @ (0x91C * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT1,0)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// PWM5DCH<PWM5DCH0>
extern volatile __bit                   PWM5DCH0            __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWM5DCH0_bit        _BIT_ACCESS(PWM5DCH,0)
// PWM5DCH<PWM5DCH1>
extern volatile __bit                   PWM5DCH1            __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWM5DCH1_bit        _BIT_ACCESS(PWM5DCH,1)
// PWM5DCH<PWM5DCH2>
extern volatile __bit                   PWM5DCH2            __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWM5DCH2_bit        _BIT_ACCESS(PWM5DCH,2)
// PWM5DCH<PWM5DCH3>
extern volatile __bit                   PWM5DCH3            __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWM5DCH3_bit        _BIT_ACCESS(PWM5DCH,3)
// PWM5DCH<PWM5DCH4>
extern volatile __bit                   PWM5DCH4            __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWM5DCH4_bit        _BIT_ACCESS(PWM5DCH,4)
// PWM5DCH<PWM5DCH5>
extern volatile __bit                   PWM5DCH5            __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWM5DCH5_bit        _BIT_ACCESS(PWM5DCH,5)
// PWM5DCH<PWM5DCH6>
extern volatile __bit                   PWM5DCH6            __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWM5DCH6_bit        _BIT_ACCESS(PWM5DCH,6)
// PWM5DCH<PWM5DCH7>
extern volatile __bit                   PWM5DCH7            __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWM5DCH7_bit        _BIT_ACCESS(PWM5DCH,7)
// PWM5DCL<PWM5DCL0>
extern volatile __bit                   PWM5DCL0            __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWM5DCL0_bit        _BIT_ACCESS(PWM5DCL,6)
// PWM5DCL<PWM5DCL1>
extern volatile __bit                   PWM5DCL1            __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWM5DCL1_bit        _BIT_ACCESS(PWM5DCL,7)
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x30CF);	// @ (0x619 * 8 + 7)
#define                                 PWM5EN_bit          _BIT_ACCESS(PWM5CON,7)
// PMD3<PWM5MD>
extern volatile __bit                   PWM5MD              __at(0x48A4);	// @ (0x914 * 8 + 4)
#define                                 PWM5MD_bit          _BIT_ACCESS(PMD3,4)
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 PWM5OUT_bit         _BIT_ACCESS(PWM5CON,5)
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 PWM5POL_bit         _BIT_ACCESS(PWM5CON,4)
// PWM6DCH<PWM6DCH0>
extern volatile __bit                   PWM6DCH0            __at(0x30D8);	// @ (0x61B * 8 + 0)
#define                                 PWM6DCH0_bit        _BIT_ACCESS(PWM6DCH,0)
// PWM6DCH<PWM6DCH1>
extern volatile __bit                   PWM6DCH1            __at(0x30D9);	// @ (0x61B * 8 + 1)
#define                                 PWM6DCH1_bit        _BIT_ACCESS(PWM6DCH,1)
// PWM6DCH<PWM6DCH2>
extern volatile __bit                   PWM6DCH2            __at(0x30DA);	// @ (0x61B * 8 + 2)
#define                                 PWM6DCH2_bit        _BIT_ACCESS(PWM6DCH,2)
// PWM6DCH<PWM6DCH3>
extern volatile __bit                   PWM6DCH3            __at(0x30DB);	// @ (0x61B * 8 + 3)
#define                                 PWM6DCH3_bit        _BIT_ACCESS(PWM6DCH,3)
// PWM6DCH<PWM6DCH4>
extern volatile __bit                   PWM6DCH4            __at(0x30DC);	// @ (0x61B * 8 + 4)
#define                                 PWM6DCH4_bit        _BIT_ACCESS(PWM6DCH,4)
// PWM6DCH<PWM6DCH5>
extern volatile __bit                   PWM6DCH5            __at(0x30DD);	// @ (0x61B * 8 + 5)
#define                                 PWM6DCH5_bit        _BIT_ACCESS(PWM6DCH,5)
// PWM6DCH<PWM6DCH6>
extern volatile __bit                   PWM6DCH6            __at(0x30DE);	// @ (0x61B * 8 + 6)
#define                                 PWM6DCH6_bit        _BIT_ACCESS(PWM6DCH,6)
// PWM6DCH<PWM6DCH7>
extern volatile __bit                   PWM6DCH7            __at(0x30DF);	// @ (0x61B * 8 + 7)
#define                                 PWM6DCH7_bit        _BIT_ACCESS(PWM6DCH,7)
// PWM6DCL<PWM6DCL0>
extern volatile __bit                   PWM6DCL0            __at(0x30D6);	// @ (0x61A * 8 + 6)
#define                                 PWM6DCL0_bit        _BIT_ACCESS(PWM6DCL,6)
// PWM6DCL<PWM6DCL1>
extern volatile __bit                   PWM6DCL1            __at(0x30D7);	// @ (0x61A * 8 + 7)
#define                                 PWM6DCL1_bit        _BIT_ACCESS(PWM6DCL,7)
// PWM6CON<PWM6EN>
extern volatile __bit                   PWM6EN              __at(0x30E7);	// @ (0x61C * 8 + 7)
#define                                 PWM6EN_bit          _BIT_ACCESS(PWM6CON,7)
// PMD3<PWM6MD>
extern volatile __bit                   PWM6MD              __at(0x48A5);	// @ (0x914 * 8 + 5)
#define                                 PWM6MD_bit          _BIT_ACCESS(PMD3,5)
// PWM6CON<PWM6OUT>
extern volatile __bit                   PWM6OUT             __at(0x30E5);	// @ (0x61C * 8 + 5)
#define                                 PWM6OUT_bit         _BIT_ACCESS(PWM6CON,5)
// PWM6CON<PWM6POL>
extern volatile __bit                   PWM6POL             __at(0x30E4);	// @ (0x61C * 8 + 4)
#define                                 PWM6POL_bit         _BIT_ACCESS(PWM6CON,4)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 RA0PPS0_bit         _BIT_ACCESS(RA0PPS,0)
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x7481);	// @ (0xE90 * 8 + 1)
#define                                 RA0PPS1_bit         _BIT_ACCESS(RA0PPS,1)
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 RA0PPS2_bit         _BIT_ACCESS(RA0PPS,2)
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 RA0PPS3_bit         _BIT_ACCESS(RA0PPS,3)
// RA0PPS<RA0PPS4>
extern volatile __bit                   RA0PPS4             __at(0x7484);	// @ (0xE90 * 8 + 4)
#define                                 RA0PPS4_bit         _BIT_ACCESS(RA0PPS,4)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// RA1PPS<RA1PPS0>
extern volatile __bit                   RA1PPS0             __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 RA1PPS0_bit         _BIT_ACCESS(RA1PPS,0)
// RA1PPS<RA1PPS1>
extern volatile __bit                   RA1PPS1             __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 RA1PPS1_bit         _BIT_ACCESS(RA1PPS,1)
// RA1PPS<RA1PPS2>
extern volatile __bit                   RA1PPS2             __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 RA1PPS2_bit         _BIT_ACCESS(RA1PPS,2)
// RA1PPS<RA1PPS3>
extern volatile __bit                   RA1PPS3             __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 RA1PPS3_bit         _BIT_ACCESS(RA1PPS,3)
// RA1PPS<RA1PPS4>
extern volatile __bit                   RA1PPS4             __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 RA1PPS4_bit         _BIT_ACCESS(RA1PPS,4)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// RA2PPS<RA2PPS0>
extern volatile __bit                   RA2PPS0             __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 RA2PPS0_bit         _BIT_ACCESS(RA2PPS,0)
// RA2PPS<RA2PPS1>
extern volatile __bit                   RA2PPS1             __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 RA2PPS1_bit         _BIT_ACCESS(RA2PPS,1)
// RA2PPS<RA2PPS2>
extern volatile __bit                   RA2PPS2             __at(0x7492);	// @ (0xE92 * 8 + 2)
#define                                 RA2PPS2_bit         _BIT_ACCESS(RA2PPS,2)
// RA2PPS<RA2PPS3>
extern volatile __bit                   RA2PPS3             __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 RA2PPS3_bit         _BIT_ACCESS(RA2PPS,3)
// RA2PPS<RA2PPS4>
extern volatile __bit                   RA2PPS4             __at(0x7494);	// @ (0xE92 * 8 + 4)
#define                                 RA2PPS4_bit         _BIT_ACCESS(RA2PPS,4)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// RA4PPS<RA4PPS0>
extern volatile __bit                   RA4PPS0             __at(0x74A0);	// @ (0xE94 * 8 + 0)
#define                                 RA4PPS0_bit         _BIT_ACCESS(RA4PPS,0)
// RA4PPS<RA4PPS1>
extern volatile __bit                   RA4PPS1             __at(0x74A1);	// @ (0xE94 * 8 + 1)
#define                                 RA4PPS1_bit         _BIT_ACCESS(RA4PPS,1)
// RA4PPS<RA4PPS2>
extern volatile __bit                   RA4PPS2             __at(0x74A2);	// @ (0xE94 * 8 + 2)
#define                                 RA4PPS2_bit         _BIT_ACCESS(RA4PPS,2)
// RA4PPS<RA4PPS3>
extern volatile __bit                   RA4PPS3             __at(0x74A3);	// @ (0xE94 * 8 + 3)
#define                                 RA4PPS3_bit         _BIT_ACCESS(RA4PPS,3)
// RA4PPS<RA4PPS4>
extern volatile __bit                   RA4PPS4             __at(0x74A4);	// @ (0xE94 * 8 + 4)
#define                                 RA4PPS4_bit         _BIT_ACCESS(RA4PPS,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// RA5PPS<RA5PPS0>
extern volatile __bit                   RA5PPS0             __at(0x74A8);	// @ (0xE95 * 8 + 0)
#define                                 RA5PPS0_bit         _BIT_ACCESS(RA5PPS,0)
// RA5PPS<RA5PPS1>
extern volatile __bit                   RA5PPS1             __at(0x74A9);	// @ (0xE95 * 8 + 1)
#define                                 RA5PPS1_bit         _BIT_ACCESS(RA5PPS,1)
// RA5PPS<RA5PPS2>
extern volatile __bit                   RA5PPS2             __at(0x74AA);	// @ (0xE95 * 8 + 2)
#define                                 RA5PPS2_bit         _BIT_ACCESS(RA5PPS,2)
// RA5PPS<RA5PPS3>
extern volatile __bit                   RA5PPS3             __at(0x74AB);	// @ (0xE95 * 8 + 3)
#define                                 RA5PPS3_bit         _BIT_ACCESS(RA5PPS,3)
// RA5PPS<RA5PPS4>
extern volatile __bit                   RA5PPS4             __at(0x74AC);	// @ (0xE95 * 8 + 4)
#define                                 RA5PPS4_bit         _BIT_ACCESS(RA5PPS,4)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// RB4PPS<RB4PPS0>
extern volatile __bit                   RB4PPS0             __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 RB4PPS0_bit         _BIT_ACCESS(RB4PPS,0)
// RB4PPS<RB4PPS1>
extern volatile __bit                   RB4PPS1             __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 RB4PPS1_bit         _BIT_ACCESS(RB4PPS,1)
// RB4PPS<RB4PPS2>
extern volatile __bit                   RB4PPS2             __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 RB4PPS2_bit         _BIT_ACCESS(RB4PPS,2)
// RB4PPS<RB4PPS3>
extern volatile __bit                   RB4PPS3             __at(0x74E3);	// @ (0xE9C * 8 + 3)
#define                                 RB4PPS3_bit         _BIT_ACCESS(RB4PPS,3)
// RB4PPS<RB4PPS4>
extern volatile __bit                   RB4PPS4             __at(0x74E4);	// @ (0xE9C * 8 + 4)
#define                                 RB4PPS4_bit         _BIT_ACCESS(RB4PPS,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// RB5PPS<RB5PPS0>
extern volatile __bit                   RB5PPS0             __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 RB5PPS0_bit         _BIT_ACCESS(RB5PPS,0)
// RB5PPS<RB5PPS1>
extern volatile __bit                   RB5PPS1             __at(0x74E9);	// @ (0xE9D * 8 + 1)
#define                                 RB5PPS1_bit         _BIT_ACCESS(RB5PPS,1)
// RB5PPS<RB5PPS2>
extern volatile __bit                   RB5PPS2             __at(0x74EA);	// @ (0xE9D * 8 + 2)
#define                                 RB5PPS2_bit         _BIT_ACCESS(RB5PPS,2)
// RB5PPS<RB5PPS3>
extern volatile __bit                   RB5PPS3             __at(0x74EB);	// @ (0xE9D * 8 + 3)
#define                                 RB5PPS3_bit         _BIT_ACCESS(RB5PPS,3)
// RB5PPS<RB5PPS4>
extern volatile __bit                   RB5PPS4             __at(0x74EC);	// @ (0xE9D * 8 + 4)
#define                                 RB5PPS4_bit         _BIT_ACCESS(RB5PPS,4)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// RB6PPS<RB6PPS0>
extern volatile __bit                   RB6PPS0             __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 RB6PPS0_bit         _BIT_ACCESS(RB6PPS,0)
// RB6PPS<RB6PPS1>
extern volatile __bit                   RB6PPS1             __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 RB6PPS1_bit         _BIT_ACCESS(RB6PPS,1)
// RB6PPS<RB6PPS2>
extern volatile __bit                   RB6PPS2             __at(0x74F2);	// @ (0xE9E * 8 + 2)
#define                                 RB6PPS2_bit         _BIT_ACCESS(RB6PPS,2)
// RB6PPS<RB6PPS3>
extern volatile __bit                   RB6PPS3             __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 RB6PPS3_bit         _BIT_ACCESS(RB6PPS,3)
// RB6PPS<RB6PPS4>
extern volatile __bit                   RB6PPS4             __at(0x74F4);	// @ (0xE9E * 8 + 4)
#define                                 RB6PPS4_bit         _BIT_ACCESS(RB6PPS,4)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// RB7PPS<RB7PPS0>
extern volatile __bit                   RB7PPS0             __at(0x74F8);	// @ (0xE9F * 8 + 0)
#define                                 RB7PPS0_bit         _BIT_ACCESS(RB7PPS,0)
// RB7PPS<RB7PPS1>
extern volatile __bit                   RB7PPS1             __at(0x74F9);	// @ (0xE9F * 8 + 1)
#define                                 RB7PPS1_bit         _BIT_ACCESS(RB7PPS,1)
// RB7PPS<RB7PPS2>
extern volatile __bit                   RB7PPS2             __at(0x74FA);	// @ (0xE9F * 8 + 2)
#define                                 RB7PPS2_bit         _BIT_ACCESS(RB7PPS,2)
// RB7PPS<RB7PPS3>
extern volatile __bit                   RB7PPS3             __at(0x74FB);	// @ (0xE9F * 8 + 3)
#define                                 RB7PPS3_bit         _BIT_ACCESS(RB7PPS,3)
// RB7PPS<RB7PPS4>
extern volatile __bit                   RB7PPS4             __at(0x74FC);	// @ (0xE9F * 8 + 4)
#define                                 RB7PPS4_bit         _BIT_ACCESS(RB7PPS,4)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// RC0PPS<RC0PPS0>
extern volatile __bit                   RC0PPS0             __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 RC0PPS0_bit         _BIT_ACCESS(RC0PPS,0)
// RC0PPS<RC0PPS1>
extern volatile __bit                   RC0PPS1             __at(0x7501);	// @ (0xEA0 * 8 + 1)
#define                                 RC0PPS1_bit         _BIT_ACCESS(RC0PPS,1)
// RC0PPS<RC0PPS2>
extern volatile __bit                   RC0PPS2             __at(0x7502);	// @ (0xEA0 * 8 + 2)
#define                                 RC0PPS2_bit         _BIT_ACCESS(RC0PPS,2)
// RC0PPS<RC0PPS3>
extern volatile __bit                   RC0PPS3             __at(0x7503);	// @ (0xEA0 * 8 + 3)
#define                                 RC0PPS3_bit         _BIT_ACCESS(RC0PPS,3)
// RC0PPS<RC0PPS4>
extern volatile __bit                   RC0PPS4             __at(0x7504);	// @ (0xEA0 * 8 + 4)
#define                                 RC0PPS4_bit         _BIT_ACCESS(RC0PPS,4)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// RC1PPS<RC1PPS0>
extern volatile __bit                   RC1PPS0             __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 RC1PPS0_bit         _BIT_ACCESS(RC1PPS,0)
// RC1PPS<RC1PPS1>
extern volatile __bit                   RC1PPS1             __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 RC1PPS1_bit         _BIT_ACCESS(RC1PPS,1)
// RC1PPS<RC1PPS2>
extern volatile __bit                   RC1PPS2             __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 RC1PPS2_bit         _BIT_ACCESS(RC1PPS,2)
// RC1PPS<RC1PPS3>
extern volatile __bit                   RC1PPS3             __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 RC1PPS3_bit         _BIT_ACCESS(RC1PPS,3)
// RC1PPS<RC1PPS4>
extern volatile __bit                   RC1PPS4             __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 RC1PPS4_bit         _BIT_ACCESS(RC1PPS,4)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// RC2PPS<RC2PPS0>
extern volatile __bit                   RC2PPS0             __at(0x7510);	// @ (0xEA2 * 8 + 0)
#define                                 RC2PPS0_bit         _BIT_ACCESS(RC2PPS,0)
// RC2PPS<RC2PPS1>
extern volatile __bit                   RC2PPS1             __at(0x7511);	// @ (0xEA2 * 8 + 1)
#define                                 RC2PPS1_bit         _BIT_ACCESS(RC2PPS,1)
// RC2PPS<RC2PPS2>
extern volatile __bit                   RC2PPS2             __at(0x7512);	// @ (0xEA2 * 8 + 2)
#define                                 RC2PPS2_bit         _BIT_ACCESS(RC2PPS,2)
// RC2PPS<RC2PPS3>
extern volatile __bit                   RC2PPS3             __at(0x7513);	// @ (0xEA2 * 8 + 3)
